In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    'value': [1,2,3,4],
    'word': ['one', 'two', 'three', 'four']})
df

   value   word
0      1    one
1      2    two
2      3  three
3      4   four

# Add a column and read/write entire series with a single operation:

In [4]:
df['double'] = df['value'] * 2
df

   value   word  double
0      1    one       2
1      2    two       4
2      3  three       6
3      4   four       8

In [5]:
df

   value   word  double
0      1    one       2
1      2    two       4
2      3  three       6
3      4   four       8

# Add a column and join on the label

In [6]:
french_words = pd.Series(
    ['trois', 'deux', 'un'],
    index = [2, 1, 0])
french_words

2    trois
1     deux
0       un
dtype: object

In [7]:
df['french'] = french_words
df

   value   word  double french
0      1    one       2     un
1      2    two       4   deux
2      3  three       6  trois
3      4   four       8    NaN

In [8]:
cities = pd.DataFrame(
    [[2463431, 2878.52], [1392609, 5110.21], [5928040, 5905.71]],
    columns=['population', 'area'],
    index = pd.Index (['Vancouver', 'Calgary', 'Toronto'], name = 'city'))

cities

           population     area
city
Vancouver     2463431  2878.52
Calgary       1392609  5110.21
Toronto       5928040  5905.71

In [9]:
def double_plus(x):
    return 2*x + 1
double_plus = np.vectorize(double_plus, otypes=[np.float64])

# Series can be input for functions

In [10]:
cities['double plus'] = double_plus(cities['population'])
cities

           population     area  double plus
city
Vancouver     2463431  2878.52    4926863.0
Calgary       1392609  5110.21    2785219.0
Toronto       5928040  5905.71   11856081.0

# How to delete a column:

In [11]:
del cities['double plus']
cities

           population     area
city
Vancouver     2463431  2878.52
Calgary       1392609  5110.21
Toronto       5928040  5905.71

In [12]:
cities['pop rank'] = cities['population'].rank(ascending=False)
cities

           population     area  pop rank
city
Vancouver     2463431  2878.52       2.0
Calgary       1392609  5110.21       3.0
Toronto       5928040  5905.71       1.0

# reset index

In [13]:
cities = cities.reset_index()
cities

        city  population     area  pop rank
0  Vancouver     2463431  2878.52       2.0
1    Calgary     1392609  5110.21       3.0
2    Toronto     5928040  5905.71       1.0

## Set Index

In [14]:
cities = cities.set_index('pop rank')
cities

               city  population     area
pop rank
2.0       Vancouver     2463431  2878.52
3.0         Calgary     1392609  5110.21
1.0         Toronto     5928040  5905.71

# Sort by index function on DataFrame

In [15]:
cities = cities.sort_index()
cities

               city  population     area
pop rank
1.0         Toronto     5928040  5905.71
2.0       Vancouver     2463431  2878.52
3.0         Calgary     1392609  5110.21